cgx_2.20/examples/OpenFOAM/couette/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.e5;

boundaryField
{
  in
  {
    type cyclic;
  }

    SYMP3           
    {
        type            empty;
    }

    wall
    {
        //type            zeroGradient;
        type            fixedValue;
        value           uniform 1.e5;
    }

    slip
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
