cgx_2.20/examples/OpenFOAM/couette/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }

    rhoU
    {
        solver          diagonal;
    }

    rhoE
    {
        solver          diagonal;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-09;
        relTol          0.01;
    }

    h
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-10 relTol 0;
    }

    e
    {
        solver          smoothSolver;
        preconditioner  GaussSeidel;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }

    k
    {
        solver          smoothSolver;
        preconditioner  GaussSeidel;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }

    epsilon
    {
        solver          smoothSolver;
        preconditioner  GaussSeidel;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }

    R
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
}


// ************************************************************************* //
